Repository: twinpigs-agile/twinpigs-architecture-compiler
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: Note
ru_ru: Замѣчаніе

source: Warning
ru_ru: Предупрежденіе

source: Error
ru_ru: Ошибка

source: Fatal
ru_ru: Фатальная ошибка

source: A C-style comment should be closed before EOF in {file}
ru_ru: Комментарій въ стиле языка C подлежитъ закрытію до конца файла {file}

source: Illegal character {char}, file {file}, line {line}, col {col}
ru_ru: Недопустимый знакъ {char}, файлъ {file}, строка {line}, столбецъ {col}

source: Illegal character in a C++-style comment: {char}, file {file}, line {line}, col {col}
ru_ru: Недопустимый знакъ въ комментариѣ стиля C++: {char}, файлъ {file}, строка {line}, столбецъ {col}

source: Illegal character in a C-style comment: {char}, file {file}, line {line}, col {col}
ru_ru: Недопустимый знакъ въ комментариѣ стиля C: {char}, файлъ {file}, строка {line}, столбецъ {col}

source: Illegal character in a string: {char}, file {file}, line {line}, col {col}
ru_ru: Недопустимый знакъ въ строкѣ: {char}, файлъ {file}, строка {line}, столбецъ {col}

source: String contains an invalid escape code, {file}, line {line}, col {col}
ru_ru: Строка содержитъ недопустимый escape-кодъ, файлъ {file}, строка {line}, столбецъ {col}

source: An unclosed string literal found, {file}, line {line}, col {col}
ru_ru: Обнаруженъ незакрытый строковый литералъ, файлъ {file}, строка {line}, столбецъ {col}

source: Property contains an invalid escape code, {file}, line {line}, col {col}
ru_ru: Свойство содержитъ недопустимый escape-кодъ, файлъ {file}, строка {line}, столбецъ {col}

source: Link info contains an invalid escape code, {file}, line {line}, col {col}
ru_ru: Информація о ссылкѣ содержитъ недопустимый escape-кодъ, файлъ {file}, строка {line}, столбецъ {col}

source: Syntax error near {v}, {f}, line {l}, col {c}
ru_ru: Синтаксическая ошибка около {v}, файлъ {f}, строка {l}, столбецъ {c}

source: Syntax error at the end of "{f}"
ru_ru: Синтаксическая ошибка въ концѣ файла "{f}"

source: An item ID should not start or end with whitespace! ID: {v}, file {f}, line {l}, col {c}
ru_ru: Идентификаторъ элемента не долженъ начинаться или оканчиваться пробѣломъ! ID: {v}, файлъ {f}, строка {l}, столбецъ {c}

source: Illegal symbols found in an item ID! ID: {v}, file {f}, line {l}, col {c}
ru_ru: Недопустимыя знаки въ идентификаторѣ элемента! ID: {v}, файлъ {f}, строка {l}, столбецъ {c}

source: Illegal symbols found in an item name! Name: {v}, file {f}, line {l}, col {c}
ru_ru: Недопустимыя знаки въ наименованіи элемента! Имя: {v}, файлъ {f}, строка {l}, столбецъ {c}

source: The object mentioned above: file {f}, line {l}, col {c}
ru_ru: Упомянутый выше объектъ: файлъ {f}, строка {l}, столбецъ {c}

source: An object's ID duplicates another object's ID. ID={v}, file {f}, line {l}, col {c}
ru_ru: Идентификаторъ объекта совпадаетъ съ другимъ. ID={v}, файлъ {f}, строка {l}, столбецъ {c}

source: An object's ID duplicates another object's name. ID/name={v}, file {f}, line {l}, col {c}
ru_ru: Идентификаторъ объекта совпадаетъ съ наименованіемъ другого. ID/имя={v}, файлъ {f}, строка {l}, столбецъ {c}

source: An object's name duplicates another object's ID. Name/ID={v}, file {f}, line {l}, col {c}
ru_ru: Наименованіе объекта совпадаетъ съ идентификаторомъ другого. Имя/ID={v}, файлъ {f}, строка {l}, столбецъ {c}

source: An object's name duplicates another object's name. name={v}, file {f}, line {l}, col {c}
ru_ru: Наименованіе объекта совпадаетъ съ наименованіемъ другого. Имя={v}, файлъ {f}, строка {l}, столбецъ {c}

source: An unresolved object reference: {v}, file {f}, line {l}, col {c}
ru_ru: Неразрѣшённая ссылка на объектъ: {v}, файлъ {f}, строка {l}, столбецъ {c}

source: A duplicate property found in a map object, id={v}, file {f}, line {l}, col {c}
ru_ru: Обнаружено повторяющееся свойство въ объектѣ map, id={v}, файлъ {f}, строка {l}, столбецъ {c}
